{
    "cards": [
        {
            "term": "10/100",
            "chapters": [
                7
            ],
            "definition": "A short reference to an Ethernet NIC or switch port that supports speed of 10 Mbps and 100 Mbps."
        },
        {
            "term": "10/100/1000",
            "chapters": [
                7
            ],
            "definition": "A short reference to an Ethernet NIC or switch port that supports speeds of 10 Mbps, 100 Mbps, and 1000 Mbps (that is, 1 Gbps)."
        },
        {
            "term": "10BASE-T",
            "chapters": [
                2
            ],
            "definition": "The 10-Mbps baseband Ethernet specification using two pairs of twisted-pair cabling (Categories 3, 4, or 5): one pair transmits data and the other receives data. 10BASE-T, which is part of the IEEE 802.3 specification, has a distance limit of approximately 100 m (328 feet) per segment."
        },
        {
            "term": "100BASE-T",
            "chapters": [
                2
            ],
            "definition": "A name for the IEEE Fast Ethernet standard that uses two-pair copper cabling, a speed of 100 Mbps, and a maximum cable length of 100 meters."
        },
        {
            "term": "1000BASE-T",
            "chapters": [
                2
            ],
            "definition": "A name for the IEEE Gigabit Ethernet standard that uses four-pair copper cabling, a speed of 1000 Mbps (1 Gbps), and a maximum cable length of 100 meters."
        },
        {
            "term": "2-way state",
            "chapters": [
                21
            ],
            "definition": "In OSPF, a neighbor state that implies that the router has exchanged Hellos with the neighbor and that all required parameters match."
        },
        {
            "term": "802.1Q",
            "chapters": [
                8
            ],
            "definition": "802.1Q is the standard protocol for this tag. The most critical piece of information (for this discussion) in this tag is the VLAN ID."
        },
        {
            "term": "AAA",
            "chapters": [
                6
            ],
            "definition": "Authentication, authorization, and accounting. Authentication confirms the identity of the user or device. Authorization determines what the user or device is allowed to do. Accounting records information about access attempts, including inappropriate requests."
        },
        {
            "term": "AAA server",
            "chapters": [
                6
            ],
            "definition": "A server that holds security information and provides services related to user login, particularly authentication (is the user who he says he is?), authorization (once authenticated, what do we allow the user to do?), and accounting (tracking the user)."
        },
        {
            "term": "access interface",
            "chapters": [
                8
            ],
            "definition": "A LAN network design term that refers to a switch interface connected to end-user devices, configured so that it does not use VLAN trunking."
        },
        {
            "term": "adjacent-layer interaction",
            "chapters": [
                1
            ],
            "definition": "The general topic of how, on one computer, two adjacent layers in a networking architectural model work together, with the lower layer providing services to the higher layer."
        },
        {
            "term": "administrative distance",
            "chapters": [
                17
            ],
            "definition": "In Cisco routers, a means for one router to choose between multiple routes to reach the same subnet when those routes were learned by different routing protocols. The lower the administrative distance, the better the source of the routing information."
        },
        {
            "term": "administrative distance",
            "chapters": [
                24
            ],
            "definition": "In Cisco routers, a means for one router to choose between multiple routes to reach the same subnet when those routes were learned by different routing protocols. The lower the administrative distance, the better the source of the routing information."
        },
        {
            "term": "all-nodes multicast address",
            "chapters": [
                27
            ],
            "definition": "A specific IPv6 multicast address, FF02::1, with link-local scope, used to send packets to all devices on the link that support IPv6."
        },
        {
            "term": "all-routers multicast address",
            "chapters": [
                27
            ],
            "definition": "A specific IPv6 multicast address, FF02::2, with link-local scope, used to send packets to all devices that act as IPv6 routers on the local link."
        },
        {
            "term": "alternate port (role)",
            "chapters": [
                9
            ],
            "definition": "With RSTP, a port role in which the port acts as an alternative to a switch’s root port, so that when the switch’s root port fails, the alternate port can immediately take over as the root port."
        },
        {
            "term": "anycast address",
            "chapters": [
                27
            ],
            "definition": "An address shared by two or more hosts that exist in different parts of the network, so that by design, the routers will forward packets to the nearest of the two servers, allowing clients to communicate with the nearest such server, not caring which particular server with which the client communicates."
        },
        {
            "term": "APIPA",
            "chapters": [
                19
            ],
            "definition": "Automatic Private IP Addressing. A convention per RFC 3927 for a process and reserved set of IPv4 addresses (169.254.0.0/16) that hosts use when they need to use an IPv4 address but they fail to lease an IPv4 address using dynamic processes like DHCP."
        },
        {
            "term": "Area Border Router (ABR)",
            "chapters": [
                21
            ],
            "definition": "A router using OSPF in which the router has interfaces in multiple OSPF areas."
        },
        {
            "term": "ARP",
            "chapters": [
                3
            ],
            "definition": "Address Resolution Protocol. An Internet protocol used to map an IP address to a MAC address. Defined in RFC 826."
        },
        {
            "term": "ARP table",
            "chapters": [
                17
            ],
            "definition": "A list of IP addresses of neighbors on the same VLAN, along with their MAC addresses, as kept in memory by hosts and routers."
        },
        {
            "term": "auto-MDIX",
            "chapters": [
                2
            ],
            "definition": "An Ethernet standard feature, introduced at the same time as Gigabit Ethernet in 1998, that senses whether the link uses the correct UTP cable pinout (straight-through or crossover), and automatically swaps the signals internally to make the link work if the wrong UTP cable pinout is used."
        },
        {
            "term": "auto-MDIX",
            "chapters": [
                7
            ],
            "definition": "An Ethernet standard feature, introduced at the same time as Gigabit Ethernet in 1998, that senses whether the link uses the correct UTP cable pinout (straight-through or crossover), and automatically swaps the signals internally to make the link work if the wrong UTP cable pinout is used."
        },
        {
            "term": "autonegotiation",
            "chapters": [
                7
            ],
            "definition": "An IEEE standard mechanism (802.3u) with which two nodes can exchange messages for the purpose of choosing to use the same Ethernet standards on both ends of the link, ensuring that the link functions and functions well."
        },
        {
            "term": "backbone area",
            "chapters": [
                21
            ],
            "definition": "In OSPFv2 and OSPFv3, the special area in a multiarea design, with all nonbackbone areas needing to connect to the backbone area, area 0."
        },
        {
            "term": "backup designated router (BDR)",
            "chapters": [
                21
            ],
            "definition": "An OSPF router connected to a multiaccess network that monitors the work of the designated router (DR) and takes over the work of the DR if the DR fails."
        },
        {
            "term": "backup port (role)",
            "chapters": [
                9
            ],
            "definition": "With RSTP, a port role in which the port acts as a backup to one of the switch’s ports acting as a designated port. If the switch’s designated port fails, the switch will use the backup port to immediately take over as the designated port."
        },
        {
            "term": "binary mask",
            "chapters": [
                13
            ],
            "definition": "An IPv4 subnet mask written as a 32-bit binary number."
        },
        {
            "term": "blocking state",
            "chapters": [
                9
            ],
            "definition": "In STP, a port state in which no received frames are processed and the switch forwards no frames out the interface, with the exception of STP messages."
        },
        {
            "term": "BPDU",
            "chapters": [
                9
            ],
            "definition": "Bridge protocol data unit. The generic name for Spanning Tree Protocol messages."
        },
        {
            "term": "BPDU Guard",
            "chapters": [
                9
            ],
            "definition": "A Cisco switch feature that listens for incoming STP BPDU messages, disabling the interface if any are received. The goal is to prevent loops when a switch connects to a port expected to only have a host connected to it."
        },
        {
            "term": "BPDU Filter",
            "chapters": [
                9
            ],
            "definition": "A Cisco switch feature that uses the monitoring and filtering (discarding) of STP BPDUs to achieve goals, such as protecting against forwarding loops on PortFast ports and disabling STP by filtering all BPDU messages."
        },
        {
            "term": "bridge ID (BID)",
            "chapters": [
                9
            ],
            "definition": "An 8-byte identifier for bridges and switches used by STP and RSTP. It is composed of a 2-byte priority field followed by a 6-byte System ID field that is usually filled with a MAC address."
        },
        {
            "term": "bridge protocol data unit (BPDU)",
            "chapters": [
                9
            ],
            "definition": " The generic name for Spanning Tree Protocol messages."
        },
        {
            "term": "broadcast address",
            "chapters": [
                2
            ],
            "definition": "Generally, any address that represents all devices, and can be used to send one message to all devices. In Ethernet, the MAC address of all binary 1s, or FFFF.FFFF.FFFF in hex. "
        },
        {
            "term": "broadcast frame",
            "chapters": [
                5
            ],
            "definition": "An Ethernet frame sent to destination address FFFF.FFFF.FFFF, meaning that the frame should be delivered to all hosts on that LAN."
        },
        {
            "term": "broadcast network type",
            "chapters": [
                23
            ],
            "definition": "An OSPF interface setting, useful on links with more than two routers, resulting in an LSA flooding process managed by an elected designated router (DR)."
        },
        {
            "term": "broadcast subnet",
            "chapters": [
                15
            ],
            "definition": "When subnetting a Class A, B, or C network, the one subnet in each classful network for which all subnet bits have a value of binary 1. The subnet broadcast address in this subnet has the same numeric value as the classful network’s networkwide broadcast address."
        },
        {
            "term": "broken state",
            "chapters": [
                9
            ],
            "definition": "An STP port state on Cisco switches, used by Root Guard and Loop Guard as a method for STP to disable the use of the port. A port in the broken state does not forward or process received frames."
        },
        {
            "term": "Channel-group",
            "chapters": [
                10
            ],
            "definition": "One term Cisco switches use to reference a bundle of links that are, in some respects, treated like a single link. Other similar terms include EtherChannel and PortChannel."
        },
        {
            "term": "CIDR Block",
            "chapters": [
                12
            ],
            "definition": "A set of consecutive public IPv4 addresses whose size can be any power of 2. Used as an alternative to the original process with public IP networks of three set sizes."
        },
        {
            "term": "CIDR mask",
            "chapters": [
                13
            ],
            "definition": "Another term for a prefix mask, one that uses prefix or CIDR notation, in which the mask is represented by a slash (/) followed by a decimal number."
        },
        {
            "term": "Cisco Catalyst Edge Platform",
            "chapters": [
                16
            ],
            "definition": "The brand name created by Cisco for a product family. The products primarily act as routers, but they also create a platform to run many other networking services, including SD-WAN, SASE, and cloud features."
        },
        {
            "term": "cladding",
            "chapters": [
                2
            ],
            "definition": "In fiber-optic cabling, the second layer of the cable, surrounding the core of the cable, with the property of reflecting light back into the core."
        },
        {
            "term": "classful addressing",
            "chapters": [
                13
            ],
            "definition": "A concept in IPv4 addressing that defines a subnetted IP address as having three parts: network, subnet, and host."
        },
        {
            "term": "classful IP network",
            "chapters": [
                11
            ],
            "definition": "An IPv4 Class A, B, or C network; called a classful network because these networks are defined by the class rules for IPv4 addressing."
        },
        {
            "term": "classful IP network",
            "chapters": [
                12
            ],
            "definition": "An IPv4 Class A, B, or C network; called a classful network because these networks are defined by the class rules for IPv4 addressing."
        },
        {
            "term": "classless addressing",
            "chapters": [
                13
            ],
            "definition": "A concept in IPv4 addressing that defines a subnetted IP address as having two parts: a prefix (or subnet) and a host."
        },
        {
            "term": "command-line interface (CLI)",
            "chapters": [
                4
            ],
            "definition": "Command-line interface. An interface that enables the user to interact with the operating system by entering commands and optional arguments."
        },
        {
            "term": "configuration mode",
            "chapters": [
                4
            ],
            "definition": "A part of the Cisco IOS Software CLI in which the user can type configuration commands that are then added to the device’s currently used configuration file (running-config)."
        },
        {
            "term": "connected route",
            "chapters": [
                17
            ],
            "definition": "On a router, an IP route added to the routing table when the router interface is both up and has an IP address configured. The route is for the subnet that can be calculated based on the configured IP address and mask."
        },
        {
            "term": "convergence",
            "chapters": [
                21
            ],
            "definition": "The time required for routing protocols to react to changes in the network, removing bad routes and adding new, better routes so that the current best routes are in all the routers’ routing tables."
        },
        {
            "term": "core",
            "chapters": [
                2
            ],
            "definition": "In fiber-optic cabling, the center cylinder of the cable, made of fiberglass, through which light passes."
        },
        {
            "term": "crossover cable",
            "chapters": [
                2
            ],
            "definition": "An Ethernet cable that swaps the pair used for transmission on one device to a pair used for receiving on the device on the opposite end of the cable. In 10BASE-T and 100BASE-TX networks, this cable swaps the pair at pins 1,2 to pins 3,6 on the other end of the cable, and the pair at pins 3,6 to pins 1,2 as well."
        },
        {
            "term": "data VLAN",
            "chapters": [
                8
            ],
            "definition": "A VLAN used by typical data devices connected to an Ethernet, like PCs and servers. Used in comparison to a voice VLAN."
        },
        {
            "term": "Dead Interval",
            "chapters": [
                21
            ],
            "definition": "In OSPF, a timer used for each neighbor. A router considers the neighbor to have failed if no Hellos are received from that neighbor in the time defined by the timer."
        },
        {
            "term": "Dead Interval",
            "chapters": [
                23
            ],
            "definition": "In OSPF, a timer used for each neighbor. A router considers the neighbor to have failed if no Hellos are received from that neighbor in the time defined by the timer."
        },
        {
            "term": "decimal mask",
            "chapters": [
                13
            ],
            "definition": "An IPv4 subnet mask written in dotted-decimal notation; for example, 255.255.255.0."
        },
        {
            "term": "de-encapsulation",
            "chapters": [
                1
            ],
            "definition": "On a computer that receives data over a network, the process in which the device interprets the lower-layer headers and, when finished with each header, removes the header, revealing the next-higher-layer PDU."
        },
        {
            "term": "default router (default gateway)",
            "chapters": [
                3
            ],
            "definition": "On an IP host, the IP address of some router to which the host sends packets when the packet’s destination address is on a subnet other than the local subnet."
        },
        {
            "term": "default router (default gateway)",
            "chapters": [
                6
            ],
            "definition": "On an IP host, the IP address of some router to which the host sends packets when the packet’s destination address is on a subnet other than the local subnet."
        },
        {
            "term": "default router (default gateway)",
            "chapters": [
                19
            ],
            "definition": "On an IP host, the IP address of some router to which the host sends packets when the packet’s destination address is on a subnet other than the local subnet."
        },
        {
            "term": "default mask",
            "chapters": [
                12
            ],
            "definition": "The mask used in a Class A, B, or C network that does not create any subnets; specifically, mask 255.0.0.0 for Class A networks, 255.255.0.0 for Class B networks, and 255.255.255.0 for Class C networks."
        },
        {
            "term": "default route",
            "chapters": [
                17
            ],
            "definition": "On a router, the route that is considered to match all packets that are not otherwise matched by some more specific route."
        },
        {
            "term": "default VLAN",
            "chapters": [
                8
            ],
            "definition": "A reference to the default setting of 1 (meaning VLAN ID 1) on the switchport access vlan vlan-id interface subcommand on Cisco switches, meaning that by default, a port will be assigned to VLAN 1 if acting as an access port."
        },
        {
            "term": "designated port (role)",
            "chapters": [
                9
            ],
            "definition": "In both STP and RSTP, a port role used to determine which of multiple interfaces on multiple switches, each connected to the same segment or collision domain, should forward frames to the segment. The switch advertising the lowest-cost Hello BPDU onto the segment becomes the DP."
        },
        {
            "term": "designated router (DR)",
            "chapters": [
                21
            ],
            "definition": "In OSPF, on a multiaccess network, the router that wins an election and is therefore responsible for managing a streamlined process for exchanging OSPF topology information between all routers attached to that network."
        },
        {
            "term": "DHCP client",
            "chapters": [
                19
            ],
            "definition": "Any device that uses DHCP protocols to ask to lease an IP address from a DHCP server, or to learn any IP settings from that server."
        },
        {
            "term": "DHCP relay agent",
            "chapters": [
                19
            ],
            "definition": "The name of the router IOS feature that forwards DHCP messages from client to servers by changing the destination IP address from 255.255.255.255 to the IP address of the DHCP server."
        },
        {
            "term": "DHCP server",
            "chapters": [
                19
            ],
            "definition": "Software that waits for DHCP clients to request to lease IP addresses, with the server assigning a lease of an IP address as well as listing other important IP settings for the client."
        },
        {
            "term": "disabled port (role)",
            "chapters": [
                9
            ],
            "definition": "In STP, a port role for nonworking interfaces—in other words, interfaces that are not in a connect or up/up interface state. The reason can be due to administrative setting (shutdown) or interface failure."
        },
        {
            "term": "disabled state",
            "chapters": [
                9
            ],
            "definition": "In STP but not RSTP, the state to be used for interfaces in the disabled port role."
        },
        {
            "term": "discarding state",
            "chapters": [
                9
            ],
            "definition": "An RSTP interface state, which primarily replaces the STP blocking state, as used for interfaces with port roles other than designated or root ports. In this state, the switch does not forward data frames out the interface, nor does it process received frames other than RSTP messages."
        },
        {
            "term": "distance vector",
            "chapters": [
                21
            ],
            "definition": "The logic behind the behavior of some interior routing protocols, such as RIP. Distance vector routing algorithms call for each router to send its entire routing table in each update, but only to its neighbors. Distance vector routing algorithms can be prone to routing loops but are computationally simpler than link-state routing algorithms."
        },
        {
            "term": "DNS",
            "chapters": [
                3
            ],
            "definition": "Domain Name System. An application layer protocol used throughout the Internet for translating hostnames into their associated IP addresses."
        },
        {
            "term": "DNS",
            "chapters": [
                6
            ],
            "definition": "Domain Name System. An application layer protocol used throughout the Internet for translating hostnames into their associated IP addresses."
        },
        {
            "term": "DNS",
            "chapters": [
                20
            ],
            "definition": "Domain Name System. An application layer protocol used throughout the Internet for translating hostnames into their associated IP addresses."
        },
        {
            "term": "DNS server",
            "chapters": [
                19
            ],
            "definition": "An application acting as a server for the purpose of providing name resolution services per the Domain Name System (DNS) protocol and worldwide system."
        },
        {
            "term": "DNS server list",
            "chapters": [
                19
            ],
            "definition": "A list of IP addresses of DNS servers, known to an IP host, used by a host when sending DNS name resolution requests."
        },
        {
            "term": "dotted-decimal notation (DDN)",
            "chapters": [
                11
            ],
            "definition": "The format used for IP version 4 addresses, in which four decimal values are used, separated by periods (dots)."
        },
        {
            "term": "dotted-decimal notation (DDN)",
            "chapters": [
                13
            ],
            "definition": "The format used for IP version 4 addresses, in which four decimal values are used, separated by periods (dots)."
        },
        {
            "term": "dual stack",
            "chapters": [
                27
            ],
            "definition": "A mode of operation in which a host or router runs both IPv4 and IPv6."
        },
        {
            "term": "duplex mismatch",
            "chapters": [
                7
            ],
            "definition": "On opposite ends of any Ethernet link, the condition in which one of the two devices uses full-duplex logic and the other uses half-duplex logic, resulting in unnecessary frame discards and retransmissions on the link."
        },
        {
            "term": "duplicate address detection (DAD)",
            "chapters": [
                28
            ],
            "definition": "A term used in IPv6 to refer to how hosts first check whether another host is using a unicast address before the first host uses that address."
        },
        {
            "term": "EIGRP version 6 (EIGRPv6)",
            "chapters": [
                25
            ],
            "definition": "The version of the EIGRP routing protocol that supports IPv6, and not IPv4."
        },
        {
            "term": "electromagnetic interference (EMI)",
            "chapters": [
                2
            ],
            "definition": "The name of the effect in which electricity passes through one cable as normal, inducing a magnetic field outside the conductor. That magnetic field, if it passes through another conductor, like a nearby cable, induces new electrical current in the second cable, interfering with the use of electricity to transmit data on the second cable."
        },
        {
            "term": "enable mode",
            "chapters": [
                4
            ],
            "definition": "A part of the Cisco IOS CLI in which the user can use the most powerful and potentially disruptive commands on a router or switch, including the ability to then reach configuration mode and reconfigure the router."
        },
        {
            "term": "enable mode",
            "chapters": [
                6
            ],
            "definition": "A part of the Cisco IOS CLI in which the user can use the most powerful and potentially disruptive commands on a router or switch, including the ability to then reach configuration mode and reconfigure the router."
        },
        {
            "term": "encapsulation",
            "chapters": [
                1
            ],
            "definition": "The placement of data from a higher-layer protocol behind the header (and in some cases, between a header and trailer) of the next-lower-layer protocol. For example, an IP packet could be encapsulated in an Ethernet header and trailer before being sent over an Ethernet."
        },
        {
            "term": "enterprise router",
            "chapters": [
                16
            ],
            "definition": "A term to describe the general role of a router as a router at a permanent site owned or leased by the enterprise, like an office building, manufacturing facility, branch office, or retail location. These sites typically have enough users to justify separate routers, switches, and wireless access points, and are more likely to justify private WAN services, in comparison to SOHO routers."
        },
        {
            "term": "equal-cost multipath (ECMP)",
            "chapters": [
                24
            ],
            "definition": "A term for a router’s forwarding logic when it has more than one route for the same subnet with the same metric (cost)."
        },
        {
            "term": "equal-cost route",
            "chapters": [
                24
            ],
            "definition": "When a routing protocol computes all possible routes to one subnet, the case for which multiple of those routes have the same metric (cost)."
        },
        {
            "term": "EtherChannel",
            "chapters": [
                9
            ],
            "definition": "A feature in which up to eight parallel Ethernet segments exist between the same two devices, each using the same speed. May be a Layer 2 EtherChannel, which acts like a single link for forwarding and Spanning Tree Protocol logic, or a Layer 3 EtherChannel, which acts like a single link for the switch’s Layer 3 routing logic."
        },
        {
            "term": "EtherChannel",
            "chapters": [
                10
            ],
            "definition": "A feature in which up to eight parallel Ethernet segments exist between the same two devices, each using the same speed. May be a Layer 2 EtherChannel, which acts like a single link for forwarding and Spanning Tree Protocol logic, or a Layer 3 EtherChannel, which acts like a single link for the switch’s Layer 3 routing logic."
        },
        {
            "term": "EtherChannel Load Distribution",
            "chapters": [
                10
            ],
            "definition": "The logic used by switches when forwarding messages over EtherChannels by which the switch chooses the specific physical link out which the switch will forward the frame."
        },
        {
            "term": "Ethernet",
            "chapters": [
                2
            ],
            "definition": "A series of LAN standards defined by the IEEE, originally invented by Xerox Corporation and developed jointly by Xerox, Intel, and Digital Equipment Corporation."
        },
        {
            "term": "Ethernet address",
            "chapters": [
                2
            ],
            "definition": "A 48-bit (6-byte) binary number, usually written as a 12-digit hexadecimal number, used to identify Ethernet nodes in an Ethernet network. Ethernet frame headers list a destination and source address field, used by the Ethernet devices to deliver Ethernet frames to the correct destination."
        },
        {
            "term": "Ethernet frame",
            "chapters": [
                2
            ],
            "definition": "A term referring to an Ethernet data-link header and trailer, plus the data encapsulated between the header and trailer."
        },
        {
            "term": "Ethernet Line Service (E-Line)",
            "chapters": [
                3
            ],
            "definition": "A specific carrier/metro Ethernet service defined by MEF (MEF.net) that provides a point-to-point topology between two customer devices, much as if the two devices were connected using an Ethernet crossover cable."
        },
        {
            "term": "Ethernet link",
            "chapters": [
                2
            ],
            "definition": "A generic term for any physical link between two Ethernet nodes, no matter what type of cabling is used."
        },
        {
            "term": "Ethernet port",
            "chapters": [
                2
            ],
            "definition": "A generic term for the opening on the side of any Ethernet node, typically in an Ethernet NIC or LAN switch, into which an Ethernet cable can be connected."
        },
        {
            "term": "Ethernet WAN",
            "chapters": [
                3
            ],
            "definition": "A general and informal term for any WAN service that uses Ethernet links as the access link between the customer and the service provider."
        },
        {
            "term": "EUI-64",
            "chapters": [
                27
            ],
            "definition": "Literally, a standard for an extended unique identifier that is 64 bits long. Specifically for IPv6, a set of rules for forming a 64-bit identifier, used as the interface ID in IPv6 addresses, by starting with a 48-bit MAC address, inserting FFFE (hex) in the middle, and inverting the seventh bit."
        },
        {
            "term": "extended ping",
            "chapters": [
                20
            ],
            "definition": "An IOS command in which the ping command accepts many other options besides just the destination IP address."
        },
        {
            "term": "Fast Ethernet",
            "chapters": [
                2
            ],
            "definition": "The common name for all the IEEE standards that send data at 100 megabits per second."
        },
        {
            "term": "fiber-optic cable",
            "chapters": [
                2
            ],
            "definition": "A type of cabling that uses glass fiber as a medium through which to transmit light."
        },
        {
            "term": "floating static route",
            "chapters": [
                17
            ],
            "definition": "A static IP route that uses a higher administrative distance than other routes, typically routes learned by a routing protocol. As a result, the router will not use the static route if the routing protocol route has been learned, but then use the static route if the routing protocol fails to learn the route."
        },
        {
            "term": "flood/flooding",
            "chapters": [
                5
            ],
            "definition": "The result of the LAN switch forwarding process for broadcasts and unknown unicast frames. Switches forward these frames out all interfaces, except the interface in which the frame arrived. Switches also flood multicasts by default, although this behavior can be changed."
        },
        {
            "term": "forward",
            "chapters": [
                5
            ],
            "definition": "To send a frame received in one interface out another interface, toward its ultimate destination."
        },
        {
            "term": "forward delay",
            "chapters": [
                9
            ],
            "definition": "An STP timer, defaulting to 15 seconds, used to dictate how long an interface stays in the listening state and the time spent in learning state. Also called the forward delay timer."
        },
        {
            "term": "forward route",
            "chapters": [
                20
            ],
            "definition": "From one host’s perspective, the route over which a packet travels from that host to some other host."
        },
        {
            "term": "forwarding state",
            "chapters": [
                9
            ],
            "definition": "An STP and RSTP port state in which an interface operates unrestricted by STP."
        },
        {
            "term": "frame",
            "chapters": [
                1
            ],
            "definition": "A term referring to a data-link header and trailer, plus the data encapsulated between the header and trailer."
        },
        {
            "term": "Frame Check Sequence",
            "chapters": [
                2
            ],
            "definition": "A field in many data-link trailers used as part of the error-detection process."
        },
        {
            "term": "full duplex",
            "chapters": [
                7
            ],
            "definition": "Generically, any communication in which two communicating devices can concurrently send and receive data. In Ethernet LANs, the allowance for both devices to send and receive at the same time, allowed when both devices disable their CSMA/CD logic."
        },
        {
            "term": "full state",
            "chapters": [
                21
            ],
            "definition": "In OSPF, a neighbor state that implies that the two routers have exchanged the complete (full) contents of their respective LSDBs."
        },
        {
            "term": "fully adjacent",
            "chapters": [
                21
            ],
            "definition": "In OSPF, a characterization of the state of a neighbor in which the two neighbors have reached the full state."
        },
        {
            "term": "Gigabit Ethernet",
            "chapters": [
                2
            ],
            "definition": "The common name for all the IEEE standards that send data at 1 gigabit per second."
        },
        {
            "term": "global routing prefix",
            "chapters": [
                26
            ],
            "definition": "An IPv6 prefix that defines an IPv6 address block made up of global unicast addresses, assigned to one organization, so that the organization has a block of globally unique IPv6 addresses to use in its network."
        },
        {
            "term": "global unicast address",
            "chapters": [
                26
            ],
            "definition": "A type of unicast IPv6 address that has been allocated from a range of public globally unique IP addresses, as registered through IANA/ICANN, its member agencies, and other registries or ISPs."
        },
        {
            "term": "half duplex",
            "chapters": [
                7
            ],
            "definition": "Generically, any communication in which only one device at a time can send data. In Ethernet LANs, the normal result of the CSMA/CD algorithm that enforces the rule that only one device should send at any point in time."
        },
        {
            "term": "HDLC",
            "chapters": [
                3
            ],
            "definition": "High-Level Data Link Control. A bit-oriented synchronous data-link layer protocol developed by the International Organization for Standardization (ISO)."
        },
        {
            "term": "Hello BPDU",
            "chapters": [
                9
            ],
            "definition": "The STP and RSTP message used for the majority of STP communications, listing the root’s bridge ID, the sending device’s bridge ID, and the sending device’s cost with which to reach the root."
        },
        {
            "term": "Hello Interval",
            "chapters": [
                21
            ],
            "definition": "With OSPF and EIGRP, an interface timer that dictates how often the router should send Hello messages."
        },
        {
            "term": "Hello Interval",
            "chapters": [
                23
            ],
            "definition": "With OSPF and EIGRP, an interface timer that dictates how often the router should send Hello messages."
        },
        {
            "term": "history buffer",
            "chapters": [
                6
            ],
            "definition": "In a Cisco router or switch, the function by which IOS keeps a list of commands that the user has used in this login session, both in EXEC mode and configuration mode. The user can then recall these commands for easier repeating or making small edits and issuing similar commands."
        },
        {
            "term": "host part",
            "chapters": [
                11
            ],
            "definition": "A term used to describe a part of an IPv4 address that is used to uniquely identify a host inside a subnet. The host part is identified by the bits of value 0 in the subnet mask."
        },
        {
            "term": "host part",
            "chapters": [
                12
            ],
            "definition": "A term used to describe a part of an IPv4 address that is used to uniquely identify a host inside a subnet. The host part is identified by the bits of value 0 in the subnet mask."
        },
        {
            "term": "host route",
            "chapters": [
                17
            ],
            "definition": "A route with a /32 mask, which by virtue of this mask represents a route to a single host IP address."
        },
        {
            "term": "hostname",
            "chapters": [
                3
            ],
            "definition": "The alphanumeric name of an IP host."
        },
        {
            "term": "hostname",
            "chapters": [
                20
            ],
            "definition": "The alphanumeric name of an IP host."
        },
        {
            "term": "ICMP echo reply",
            "chapters": [
                20
            ],
            "definition": "One type of ICMP message, created specifically to be used as the message sent by the ping command to test connectivity in a network. The ping command expects to receive these messages from other hosts, after the ping command first sends an ICMP echo request message to the host."
        },
        {
            "term": "ICMP echo request",
            "chapters": [
                20
            ],
            "definition": "One type of ICMP message, created specifically to be used as the message sent by the ping command to test connectivity in a network. The ping command sends these messages to other hosts, expecting the other host to reply with an ICMP echo reply message."
        },
        {
            "term": "IEEE",
            "chapters": [
                2
            ],
            "definition": "Institute of Electrical and Electronics Engineers. A professional organization that develops communications and network standards, among other activities."
        },
        {
            "term": "Integrated Services Router (ISR)",
            "chapters": [
                16
            ],
            "definition": "Cisco’s long-running term for several different model series of Enterprise-class routers, intended mostly for use as enterprise routers and some use as SOHO routers. ISR routers first serve as routers but, depending on the family or specific model, support all current types of WAN connections (private and Internet), LAN switching ports, Wireless APs, VPNs, and other integrated functions supported in a single device."
        },
        {
            "term": "interface bandwidth",
            "chapters": [
                23
            ],
            "definition": "In OSPF, the numerator in the calculation of an interface’s default OSPF cost metric, calculated as the interface bandwidth divided by the reference bandwidth."
        },
        {
            "term": "Interface ID (IID)",
            "chapters": [
                26
            ],
            "definition": "The ending (rightmost) portion of the structure of an IPv6 address, usually 64 bits long."
        },
        {
            "term": "interface-local scope",
            "chapters": [
                27
            ],
            "definition": "A concept in IPv6 for which packets sent to an address using this scope should not physically exit the interface, keeping the packet inside the sending host."
        },
        {
            "term": "interior gateway protocol (IGP)",
            "chapters": [
                21
            ],
            "definition": "A routing protocol designed to be used to exchange routing information inside a single autonomous system."
        },
        {
            "term": "internal router",
            "chapters": [
                21
            ],
            "definition": "In OSPF, a router with all interfaces in the same nonbackbone area."
        },
        {
            "term": "IOS",
            "chapters": [
                4
            ],
            "definition": "Internetwork Operating System. The operating system (OS) of Cisco routers and switches, which provides the majority of a router’s or switch’s features, with the hardware providing the remaining features."
        },
        {
            "term": "IOS",
            "chapters": [
                16
            ],
            "definition": "Internetwork Operating System. The operating system (OS) of Cisco routers and switches, which provides the majority of a router’s or switch’s features, with the hardware providing the remaining features."
        },
        {
            "term": "IOS XE",
            "chapters": [
                4
            ],
            "definition": "A Cisco operating system (OS) with a modern Linux-based multitasking software architecture used as the OS for many enterprise-class LAN switch and router products."
        },
        {
            "term": "IOS XE",
            "chapters": [
                16
            ],
            "definition": "A Cisco operating system (OS) with a modern Linux-based multitasking software architecture used as the OS for many enterprise-class LAN switch and router products."
        },
        {
            "term": "IP address",
            "chapters": [
                3
            ],
            "definition": "In IP version 4 (IPv4), a 32-bit address assigned to hosts using TCP/IP. Each address consists of a network number, an optional subnetwork number, and a host number. The network and subnetwork numbers together are used for routing, and the host number is used to address an individual host within the network or subnetwork."
        },
        {
            "term": "IP network",
            "chapters": [
                3
            ],
            "definition": "An IPv4 Class A, B, or C network; called a classful network because these networks are defined by the class rules for IPv4 addressing."
        },
        {
            "term": "IP packet",
            "chapters": [
                3
            ],
            "definition": "An IP header, followed by the data encapsulated after the IP header, but specifically not including any headers and trailers for layers below the network layer."
        },
        {
            "term": "IP subnet",
            "chapters": [
                3
            ],
            "definition": "Subdivisions of a Class A, B, or C network, as configured by a network administrator. Subnets allow a single Class A, B, or C network to be used instead of multiple networks, and still allow for a large number of groups of IP addresses, as is required for efficient IP routing."
        },
        {
            "term": "IP version 6 (IPv6)",
            "chapters": [
                25
            ],
            "definition": "A newer version of the Internet Protocol defined in RFC 2460, as well as many other RFCs, whose creation was motivated by the need to avoid the IPv4 address exhaustion problem."
        },
        {
            "term": "IPv4 address exhaustion",
            "chapters": [
                25
            ],
            "definition": "The process by which the public IPv4 addresses, available to create the Internet, were consumed through the 1980s until today, with the expectation that eventually the world would run out of available IPv4 addresses."
        },
        {
            "term": "IPv6 address scope",
            "chapters": [
                27
            ],
            "definition": "The concept of how far an IPv6 packet should be forwarded by hosts and routers in an IPv6 network. Includes interface-local, link-local, site-local, and organization-local scopes."
        },
        {
            "term": "IPv6 administrative distance",
            "chapters": [
                29
            ],
            "definition": "In Cisco routers, a means for one router to choose between multiple IPv6 routes to reach the same subnet when those routes were learned by different routing protocols. The lower the administrative distance, the better the source of the routing information."
        },
        {
            "term": "IPv6 host route",
            "chapters": [
                29
            ],
            "definition": "A route with a /128 mask, which by virtue of this mask represents a route to a single host IPv6 address."
        },
        {
            "term": "IPv6 local route",
            "chapters": [
                29
            ],
            "definition": "A route added to an IPv6 router’s routing table for the router’s interface IP address, with a /128 mask, which by virtue of this mask represents a route to only that router’s IPv4 address."
        },
        {
            "term": "IPv6 neighbor table",
            "chapters": [
                28
            ],
            "definition": "The IPv6 equivalent of the ARP table. A table that lists IPv6 addresses of other hosts on the same link, along with their matching MAC addresses, as typically learned using Neighbor Discovery Protocol (NDP)."
        },
        {
            "term": "known unicast frame",
            "chapters": [
                5
            ],
            "definition": "An Ethernet frame whose destination MAC address is listed in a switch’s MAC address table, so the switch will forward the frame out the one port associated with that entry in the MAC address table."
        },
        {
            "term": "LACP",
            "chapters": [
                10
            ],
            "definition": "Link Aggregation Control Protocol is a messaging protocol defined by the IEEE 802.3ad standard that enables two neighboring devices to realize that they have multiple parallel links connecting to each other and then to decide which links can be combined into an EtherChannel."
        },
        {
            "term": "late collisions",
            "chapters": [
                7
            ],
            "definition": "In Ethernet, collisions that occur after the 64th byte in a frame—an event that should not occur with a LAN that follows correct design principles. Late collisions occur most often in modern networks due to a duplex mismatch."
        },
        {
            "term": "Layer 3 EtherChannel (L3 EtherChannel)",
            "chapters": [
                18
            ],
            "definition": "An EtherChannel that acts as a routed port (that is, not a switched port), and as such, is used by a switch’s Layer 3 forwarding logic. As a result, the Layer 3 switch lists the Layer 3 EtherChannel in various routes in the switch’s IP routing table, with the switch balancing traffic across the various ports in the Layer 3 EtherChannel."
        },
        {
            "term": "Layer 3 switch",
            "chapters": [
                8
            ],
            "definition": "A LAN switch that can also perform Layer 3 routing functions. The name comes from the fact that this device makes forwarding decisions based on logic from multiple OSI layers (Layers 2 and 3)."
        },
        {
            "term": "Layer 3 switch",
            "chapters": [
                18
            ],
            "definition": "A LAN switch that can also perform Layer 3 routing functions. The name comes from the fact that this device makes forwarding decisions based on logic from multiple OSI layers (Layers 2 and 3)."
        },
        {
            "term": "learning state",
            "chapters": [
                9
            ],
            "definition": "In STP, a temporary port state in which the interface does not forward frames, but it can begin to learn MAC addresses from frames received on the interface."
        },
        {
            "term": "leased line",
            "chapters": [
                3
            ],
            "definition": "A serial communications circuit between two points, provided by some service provider, typically a telephone company (telco). Because the telco does not sell a physical cable between the two endpoints, instead charging a monthly fee for the ability to send bits between the two sites, the service is considered to be a leased service."
        },
        {
            "term": "link-state",
            "chapters": [
                21
            ],
            "definition": "A classification of the underlying algorithm used in some routing protocols. Link-state protocols build a detailed database that lists links (subnets) and their state (up, down), from which the best routes can then be calculated."
        },
        {
            "term": "link-local address (LLA)",
            "chapters": [
                27
            ],
            "definition": "A unicast IPv6 address that begins FE80, used on each IPv6-enabled interface, used for sending packets within the attached link by applying a link-local scope."
        },
        {
            "term": "link-local multicast address",
            "chapters": [
                27
            ],
            "definition": "A multicast IPv6 address that begins with FF02, with the fourth digit of 2 identifying the scope as link-local, to which devices apply a link-local scope."
        },
        {
            "term": "link-local scope",
            "chapters": [
                27
            ],
            "definition": "With IPv6 multicasts, a term that refers to the parts (scope) of the network to which a multicast packet can flow, with link-local referring to the fact that the packet stays on the subnet in which it originated."
        },
        {
            "term": "link-state advertisement (LSA)",
            "chapters": [
                21
            ],
            "definition": "In OSPF, the name of the data structure that resides inside the LSDB and describes in detail the various components in a network, including routers and links (subnets)."
        },
        {
            "term": "link-state database (LSDB)",
            "chapters": [
                21
            ],
            "definition": "In OSPF, the data structure in RAM of a router that holds the various LSAs, with the collective LSAs representing the entire topology of the network."
        },
        {
            "term": "link-state update",
            "chapters": [
                21
            ],
            "definition": "An OSPF packet used to send an LSA to a neighboring router."
        },
        {
            "term": "listening state",
            "chapters": [
                9
            ],
            "definition": "A temporary STP port state that occurs immediately when a blocking interface must be moved to a forwarding state. The switch times out MAC table entries during this state. It also ignores frames received on the interface and doesn’t forward any frames out the interface."
        },
        {
            "term": "local route",
            "chapters": [
                29
            ],
            "definition": "A route added to an IPv4 router’s routing table for the router’s interface IP address, with a /32 mask, which by virtue of this mask represents a route to only that router’s IPv4 address."
        },
        {
            "term": "local username",
            "chapters": [
                6
            ],
            "definition": "A username (with matching password), configured on a router or switch. It is considered local because it exists on the router or switch, and not on a remote server."
        },
        {
            "term": "log message",
            "chapters": [
                6
            ],
            "definition": "A message generated by any computer, but including Cisco routers and switches, for which the device OS wants to notify the owner or administrator of the device about some event."
        },
        {
            "term": "longest prefix match",
            "chapters": [
                24
            ],
            "definition": "When a router’s IP routing table has more than one route that matches a packet’s destination address, the choice to use the matching route with the longest mask (the mask with the largest number of binary 1s in the mask)."
        },
        {
            "term": "Loop Guard",
            "chapters": [
                9
            ],
            "definition": "A complex Cisco switch mechanism that protects against STP loops in a specific common case. For switches whose switch-to-switch links settle into either a root port or an alternate port role, as expected per the STP design, Loop Guard disables use of those ports if normal STP operation attempts to assign them the designated port role."
        },
        {
            "term": "MAC address",
            "chapters": [
                2
            ],
            "definition": "A standardized data-link layer address that is required for every device that connects to a LAN. Ethernet MAC addresses are 6 bytes long and are controlled by the IEEE. Also known as a hardware address, a MAC layer address, and a physical address."
        },
        {
            "term": "MAC address table",
            "chapters": [
                5
            ],
            "definition": "A table of forwarding information held by a Layer 2 switch, built dynamically by listening to incoming frames and used by the switch to match frames to make decisions about where to forward the frame."
        },
        {
            "term": "MaxAge",
            "chapters": [
                9
            ],
            "definition": "In STP, a timer that states how long a switch should wait when it no longer receives Hellos from the root switch before acting to reconverge the STP topology. Also called the MaxAge timer."
        },
        {
            "term": "metric",
            "chapters": [
                21
            ],
            "definition": "A unit of measure used by routing protocol algorithms to determine the best route for traffic to use to reach a particular destination."
        },
        {
            "term": "multiarea OSPF",
            "chapters": [
                21
            ],
            "definition": "In OSPFv2 and OSPFv3, a design that uses more than one area within one OSPF domain (typically a single company)."
        },
        {
            "term": "multilayer switch",
            "chapters": [
                18
            ],
            "definition": "A LAN switch that can also perform Layer 3 routing functions. The name comes from the fact that this device makes forwarding decisions based on logic from multiple OSI layers (Layers 2 and 3)."
        },
        {
            "term": "multimode fiber",
            "chapters": [
                2
            ],
            "definition": "A type of fiber cable that works well with transmitters like LEDs that emit multiple angles of light into the core of the cable; to accommodate the multiple angles of incident, the cable has a larger core in comparison to single-mode fiber cables."
        },
        {
            "term": "name resolution",
            "chapters": [
                6
            ],
            "definition": "The process by which an IP host discovers the IP address associated with a hostname, often involving sending a DNS request to a DNS server, with the server supplying the IP address used by a host with the listed hostname."
        },
        {
            "term": "native VLAN",
            "chapters": [
                8
            ],
            "definition": "The one VLAN ID on any 802.1Q VLAN trunk for which the trunk forwards frames without an 802.1Q header."
        },
        {
            "term": "neighbor",
            "chapters": [
                21
            ],
            "definition": "In routing protocols, another router with which a router decides to exchange routing information."
        },
        {
            "term": "Neighbor Advertisement (NA)",
            "chapters": [
                28
            ],
            "definition": "A message defined by the IPv6 Neighbor Discovery Protocol (NDP), used to declare to other neighbors a host’s MAC address. Sometimes sent in response to a previously received NDP Neighbor Solicitation (NS) message."
        },
        {
            "term": "Neighbor Discovery Protocol (NDP)",
            "chapters": [
                28
            ],
            "definition": "A protocol that is part of the IPv6 protocol suite, used to discover and exchange information about devices on the same subnet (neighbors). In particular, it replaces the IPv4 ARP protocol."
        },
        {
            "term": "Neighbor Solicitation (NS)",
            "chapters": [
                28
            ],
            "definition": "A message defined by the IPv6 Neighbor Discovery Protocol (NDP), used to ask a neighbor to reply with a Neighbor Advertisement, which lists the neighbor’s MAC address."
        },
        {
            "term": "network",
            "chapters": [
                11
            ],
            "definition": "A collection of computers, printers, routers, switches, and other devices that can communicate with each other over some transmission medium."
        },
        {
            "term": "network",
            "chapters": [
                12
            ],
            "definition": "A collection of computers, printers, routers, switches, and other devices that can communicate with each other over some transmission medium."
        },
        {
            "term": "network address",
            "chapters": [
                12
            ],
            "definition": "A number that uses dotted-decimal notation like IP addresses, but the number itself represents all hosts in a single Class A, B, or C IP network."
        },
        {
            "term": "network broadcast address",
            "chapters": [
                12
            ],
            "definition": "In IPv4, a special address in each classful network that can be used to broadcast a packet to all hosts in that same classful network. Numerically, the address has the same value as the network number in the network part of the address and all 255s in the host octets; for example, 10.255.255.255 is the network broadcast address for classful network 10.0.0.0."
        },
        {
            "term": "network ID",
            "chapters": [
                12
            ],
            "definition": "A number that identifies an IPv4 network, using a number in dotted-decimal notation (like IP addresses); a number that represents any single Class A, B, or C IP network."
        },
        {
            "term": "network interface card (NIC)",
            "chapters": [
                2
            ],
            "definition": "A computer card, sometimes an expansion card and sometimes integrated into the motherboard of the computer, that provides the electronics and other functions to connect to a computer network. Today, most NICs are specifically Ethernet NICs, and most have an RJ-45 port, the most common type of Ethernet port."
        },
        {
            "term": "network number",
            "chapters": [
                12
            ],
            "definition": "A number that uses dotted-decimal notation like IP addresses, but the number itself represents all hosts in a single Class A, B, or C IP network."
        },
        {
            "term": "network part",
            "chapters": [
                11
            ],
            "definition": "The portion of an IPv4 address that is either 1, 2, or 3 octets/bytes long, based on whether the address is in a Class A, B, or C network."
        },
        {
            "term": "network part",
            "chapters": [
                12
            ],
            "definition": "The portion of an IPv4 address that is either 1, 2, or 3 octets/bytes long, based on whether the address is in a Class A, B, or C network."
        },
        {
            "term": "network route",
            "chapters": [
                17
            ],
            "definition": "A route for a classful network."
        },
        {
            "term": "networking model",
            "chapters": [
                1
            ],
            "definition": "A generic term referring to any set of protocols and standards collected into a comprehensive grouping that, when followed by the devices in a network, allows all the devices to communicate. Examples include TCP/IP and OSI."
        },
        {
            "term": "next-hop router",
            "chapters": [
                17
            ],
            "definition": "In an IP route in a routing table, part of a routing table entry that refers to the next IP router (by IP address) that should receive packets that match the route."
        },
        {
            "term": "on-link prefix",
            "chapters": [
                28
            ],
            "definition": "An IPv6 subnet prefix, advertised by a router in an NDP Router Advertisement (RA) message, that identifies to on-link hosts a subnet considered to exist on the local link."
        },
        {
            "term": "organization-local scope",
            "chapters": [
                27
            ],
            "definition": "A concept in IPv6 for which packets sent to an address using this scope should be forwarded by routers inside the organization but not over any links connected to other organizations or over links connected to the Internet."
        },
        {
            "term": "OSPF neighbor",
            "chapters": [
                22
            ],
            "definition": "A local router’s attitude toward a second router that resides on a common subnet, when both use OSPF and use appropriate OSPF settings so that the routers will choose to exchange routing information with each other."
        },
        {
            "term": "OSPF priority",
            "chapters": [
                23
            ],
            "definition": "An OSPF interface setting that serves as the first comparison point in the designated router (DR) election process, with the router interface with the highest priority winning the election."
        },
        {
            "term": "OSPF router-id",
            "chapters": [
                22
            ],
            "definition": "In OSPF, the 32-bit number, normally shown in dotted-decimal notation but also allowed to be listed as an integer, intended as a unique identifier for each OSPF router in an OSPF domain."
        },
        {
            "term": "OSPF version 3 (OSPFv3)",
            "chapters": [
                25
            ],
            "definition": "The version of the OSPF routing protocol that originally supported only IPv6, and not IPv4, but now supports IPv4 through the use of address family configuration."
        },
        {
            "term": "outgoing interface",
            "chapters": [
                17
            ],
            "definition": "In an IP route in a routing table, part of a routing table entry that refers to the local interface out which the local router should forward packets that match the route."
        },
        {
            "term": "packet",
            "chapters": [
                1
            ],
            "definition": "A logical grouping of bytes that includes the network layer header and encapsulated data, but specifically does not include any headers and trailers below the network layer."
        },
        {
            "term": "PAgP",
            "chapters": [
                10
            ],
            "definition": "Port Aggregation Protocol (PAgP) is a messaging protocol defined by Cisco that enables two neighboring devices to realize that they have multiple parallel links connecting to each other and then to decide which links can be combined into an EtherChannel."
        },
        {
            "term": "parallel detection",
            "chapters": [
                7
            ],
            "definition": "The term for the branch of IEEE autonegotiation steps that applies to a device that uses autonegotiation but the device on the other end of the link does not."
        },
        {
            "term": "passive interface",
            "chapters": [
                23
            ],
            "definition": "With a routing protocol, a router interface for which the routing protocol is enabled on the interface, but for which the routing protocol does not send routing protocol messages out that interface."
        },
        {
            "term": "permanent IPv6 address",
            "chapters": [
                28
            ],
            "definition": "When using IPv6 SLAAC, a host creates an address with an infinite preferred and valid lifetime, making the address permanent, using the address when listening for incoming connections to any services running on that host."
        },
        {
            "term": "ping",
            "chapters": [
                3
            ],
            "definition": "An Internet Control Message Protocol (ICMP) echo message and its reply; ping often is used in IP networks to test the reachability of a network device."
        },
        {
            "term": "ping",
            "chapters": [
                20
            ],
            "definition": "An Internet Control Message Protocol (ICMP) echo message and its reply; ping often is used in IP networks to test the reachability of a network device."
        },
        {
            "term": "point-to-point network type",
            "chapters": [
                23
            ],
            "definition": "An OSPF interface setting, useful on links in a point-to-point topology with only two routers, resulting in flooding directly between the routers without the use of a designated router (DR)."
        },
        {
            "term": "PortChannel",
            "chapters": [
                10
            ],
            "definition": "One term Cisco switches use to reference a bundle of links that are, in some respects, treated like a single link. Other similar terms include EtherChannel and Channel-group."
        },
        {
            "term": "PortFast",
            "chapters": [
                9
            ],
            "definition": "A switch STP feature in which a port is placed in an STP forwarding state as soon as the interface comes up, bypassing the listening and learning states. This feature is meant for ports connected to end-user devices."
        },
        {
            "term": "preferred lifetime",
            "chapters": [
                28
            ],
            "definition": "In the context of IPv6 addresses, a timer applied to a SLAAC-created address defining how long the address is preferred, meaning the host uses the address for new and existing application flows."
        },
        {
            "term": "prefix discovery",
            "chapters": [
                28
            ],
            "definition": "IPv6 neighbor discovery protocol (NDP) function, specifically part of the Router Advertisement (RA) message, in which the router supplies a list of IPv6 subnet prefixes and prefix lengths that exist on the local link."
        },
        {
            "term": "prefix length",
            "chapters": [
                25
            ],
            "definition": "In IPv6, the number of bits in an IPv6 prefix."
        },
        {
            "term": "prefix mask",
            "chapters": [
                13
            ],
            "definition": "A term to describe an IPv4 subnet mask when represented as a slash (/) followed by a decimal number. The decimal number is the number of binary 1s in the mask."
        },
        {
            "term": "private IP network",
            "chapters": [
                11
            ],
            "definition": "Any of the IPv4 Class A, B, or C networks as defined by RFC 1918, intended for use inside a company but not used as public IP networks."
        },
        {
            "term": "public IP network",
            "chapters": [
                11
            ],
            "definition": "Any IPv4 Class A, B, or C network assigned for use by one organization only, so that the addresses in the network are unique across the Internet, allowing packets to be sent through the public Internet using the addresses."
        },
        {
            "term": "PVST+",
            "chapters": [
                10
            ],
            "definition": "An STP option in Cisco switches that creates an STP instance per VLAN. Cisco proprietary."
        },
        {
            "term": "quartet",
            "chapters": [
                25
            ],
            "definition": "A term used in this book, but not in other references, to refer to a set of four hex digits in an IPv6 address."
        },
        {
            "term": "Rapid PVST+",
            "chapters": [
                10
            ],
            "definition": "An STP option in Cisco switches that creates an RSTP instance per VLAN. Cisco proprietary."
        },
        {
            "term": "Rapid STP (RSTP)",
            "chapters": [
                9
            ],
            "definition": "Defined in IEEE 802.lw. Defines an improved version of STP that converges much more quickly and consistently than STP (802.Id)."
        },
        {
            "term": "reference bandwidth",
            "chapters": [
                23
            ],
            "definition": "In OSPF, a configurable value for the OSPF routing process, used by OSPF when calculating an interface’s default OSPF cost metric, calculated as the interface’s bandwidth divided by the reference bandwidth."
        },
        {
            "term": "resident subnet",
            "chapters": [
                14
            ],
            "definition": "Each IP subnet contains a number of unicast IP addresses; that subnet is the resident subnet for each of those addresses—that is, the subnet in which those addresses reside."
        },
        {
            "term": "reverse route",
            "chapters": [
                20
            ],
            "definition": "From one host’s perspective, for packets sent back to the host from another host, the route over which the packet travels."
        },
        {
            "term": "RJ-45",
            "chapters": [
                2
            ],
            "definition": "A popular type of cabling connector used for Ethernet cabling. It is similar to the RJ-11 connector used for telephone wiring in homes in the United States. RJ-45 allows the connection of eight wires."
        },
        {
            "term": "rollover cable",
            "chapters": [
                4
            ],
            "definition": "For connections to the RJ-45 console port rather than USB console port of a Cisco device, the type of cable used between the user PC and the console port. The UTP rollover cable uses a rollover pinout with eight pins, connecting pin 1 to pin 8, pin 2 to pin 7, and so on."
        },
        {
            "term": "root cost",
            "chapters": [
                9
            ],
            "definition": "The STP cost from a nonroot switch to reach the root switch, as the sum of all STP costs for all ports out which a frame would exit to reach the root."
        },
        {
            "term": "Root Guard",
            "chapters": [
                9
            ],
            "definition": "A Cisco switch feature that protects against unexpected new root switches. When enabled on an interface, IOS uses normal STP rules except to disable the use of the port after receiving a superior BPDU."
        },
        {
            "term": "root port (role)",
            "chapters": [
                9
            ],
            "definition": "In STP and RSTP, the one port on a nonroot switch in which the least-cost Hello is received. Switches put root ports in a forwarding state."
        },
        {
            "term": "root switch",
            "chapters": [
                9
            ],
            "definition": "In STP and RSTP, the switch that wins the election by virtue of having the lowest bridge ID and, as a result, sends periodic Hello BPDUs (default, 2 seconds)."
        },
        {
            "term": "routed port",
            "chapters": [
                18
            ],
            "definition": "A reference to the default logic on an interface on a router, such as de-encapsulating the Layer 3 packet from incoming Layer 2 frames and passing the packet to the Layer 3 forwarding logic of the device."
        },
        {
            "term": "Router Advertisement (RA)",
            "chapters": [
                28
            ],
            "definition": "A message defined by the IPv6 Neighbor Discovery Protocol (NDP), used by routers to announce their willingness to act as an IPv6 router on a link. These can be sent in response to a previously received NDP Router Solicitation (RS) message."
        },
        {
            "term": "router ID (RID)",
            "chapters": [
                21
            ],
            "definition": "In EIGRP and OSPF, a 32-bit number, written in dotted-decimal notation, that uniquely identifies each router."
        },
        {
            "term": "Router-on-a-Stick (ROAS)",
            "chapters": [
                18
            ],
            "definition": "Jargon to refer to the Cisco router feature of using VLAN trunking on an Ethernet interface, which then allows the router to route packets that happen to enter the router on that trunk and then exit the router on that same trunk, just on a different VLAN."
        },
        {
            "term": "Router Solicitation (RS)",
            "chapters": [
                28
            ],
            "definition": "A message defined by the IPv6 Neighbor Discovery Protocol (NDP), used to ask any routers on the link to reply, identifying the router, plus other configuration settings (prefixes and prefix lengths)."
        },
        {
            "term": "routing protocol",
            "chapters": [
                3
            ],
            "definition": "A set of messages and processes with which routers can exchange information about routes to reach subnets in a particular network. Examples of routing protocols include Enhanced Interior Gateway Routing Protocol (EIGRP), Open Shortest Path First (OSPF), and Routing Information Protocol (RIP)."
        },
        {
            "term": "routing table",
            "chapters": [
                3
            ],
            "definition": "A list of routes in a router, with each route listing the destination subnet and mask, the router interface out which to forward packets destined to that subnet, and as needed, the next-hop router’s IP address."
        },
        {
            "term": "routing table",
            "chapters": [
                17
            ],
            "definition": "A list of routes in a router, with each route listing the destination subnet and mask, the router interface out which to forward packets destined to that subnet, and as needed, the next-hop router’s IP address."
        },
        {
            "term": "running-config file",
            "chapters": [
                4
            ],
            "definition": "In Cisco IOS switches and routers, the name of the file that resides in RAM, holding the device’s currently used configuration."
        },
        {
            "term": "same-layer interaction",
            "chapters": [
                1
            ],
            "definition": "The communication between two networking devices for the purposes of the functions defined at a particular layer of a networking model, with that communication happening by using a header defined by that layer of the model. The two devices set values in the header, send the header and encapsulated data, with the receiving devices interpreting the header to decide what action to take."
        },
        {
            "term": "Secure Shell (SSH)",
            "chapters": [
                4
            ],
            "definition": "A TCP/IP application layer protocol that supports terminal emulation between a client and server, using dynamic key exchange and encryption to keep the communications private."
        },
        {
            "term": "Secure Shell (SSH)",
            "chapters": [
                6
            ],
            "definition": "A TCP/IP application layer protocol that supports terminal emulation between a client and server, using dynamic key exchange and encryption to keep the communications private."
        },
        {
            "term": "segment",
            "chapters": [
                1
            ],
            "definition": "In TCP, a term used to describe a TCP header and its encapsulated data (also called an L4PDU). Also in TCP, the process of accepting a large chunk of data from the application layer and breaking it into smaller pieces that fit into TCP segments. In Ethernet, a segment is either a single Ethernet cable or a single collision domain (no matter how many cables are used)."
        },
        {
            "term": "serial interface",
            "chapters": [
                3
            ],
            "definition": "A type of interface on a router, used to connect to some types of WAN links, particularly leased lines and Frame Relay access links."
        },
        {
            "term": "shortest path first (SPF) algorithm",
            "chapters": [
                21
            ],
            "definition": "The name of the algorithm used by link-state routing protocols to analyze the LSDB and find the least-cost routes from that router to each subnet."
        },
        {
            "term": "single-area OSPF",
            "chapters": [
                21
            ],
            "definition": "In OSPFv2 and OSPFv3, a design that uses a single area within one OSPF domain (typically a single company)."
        },
        {
            "term": "single-mode fiber",
            "chapters": [
                2
            ],
            "definition": "A type of fiber cable that works well with transmitters like lasers that emit a single angle of light into the core of the cable, allowing for a smaller core in comparison to multimode fiber cables."
        },
        {
            "term": "site-local scope",
            "chapters": [
                27
            ],
            "definition": "A concept in IPv6 for which packets sent to an address using this scope should be forwarded by routers, but not forwarded over WAN links to other sites."
        },
        {
            "term": "SOHO router",
            "chapters": [
                16
            ],
            "definition": "A term to describe the general role of a router that exists as part of the enterprise network but resides at an employee’s home or at a smaller business site, possibly with a short-term lease compared to larger enterprise sites. These sites typically have few devices, so it makes sense to use one device that integrates routing, switches, wireless, and other features into a single device (the SOHO router) and are more likely to justify Internet access as the primary WAN access method."
        },
        {
            "term": "solicited-node multicast address",
            "chapters": [
                27
            ],
            "definition": "A type of IPv6 multicast address, with link-local scope, used to send packets to all hosts in the subnet that share the same value in the last six hex digits of their unicast IPv6 addresses. Begins with FF02::1:FF00:0/104."
        },
        {
            "term": "Spanning Tree Protocol (STP)",
            "chapters": [
                5
            ],
            "definition": "A protocol defined by IEEE standard 802.ID. Allows switches and bridges to create a redundant LAN, with the protocol dynamically causing some ports to block traffic, so that the bridge/switch forwarding logic will not cause frames to loop indefinitely around the LAN."
        },
        {
            "term": "Spanning Tree Protocol (STP)",
            "chapters": [
                9
            ],
            "definition": "A protocol defined by IEEE standard 802.ID. Allows switches and bridges to create a redundant LAN, with the protocol dynamically causing some ports to block traffic, so that the bridge/switch forwarding logic will not cause frames to loop indefinitely around the LAN."
        },
        {
            "term": "startup-config file",
            "chapters": [
                4
            ],
            "definition": "In Cisco IOS switches and routers, the name of the file that resides in NVRAM memory, holding the device’s configuration that will be loaded into RAM as the running-config file when the device is next reloaded or powered on."
        },
        {
            "term": "stateful DHCPv6",
            "chapters": [
                28
            ],
            "definition": "A term used in IPv6 to contrast with stateless DHCP. Stateful DHCP keeps track of which clients have been assigned which IPv6 addresses (state information)."
        },
        {
            "term": "stateless address autoconfiguration (SLAAC)",
            "chapters": [
                28
            ],
            "definition": "A feature of IPv6 in which a host or router can be assigned an IPv6 unicast address without the need for a stateful DHCP server."
        },
        {
            "term": "stateless DHCPv6",
            "chapters": [
                28
            ],
            "definition": "A term used in IPv6 to contrast with stateful DHCP. Stateless DHCP servers don’t lease IPv6 addresses to clients. Instead, they supply other useful information, such as DNS server IP addresses, but with no need to track information about the clients (state information)."
        },
        {
            "term": "static access interface",
            "chapters": [
                8
            ],
            "definition": "A LAN network design term, synonymous with the term access interface, but emphasizing that the port is assigned to one VLAN as a result of static configuration rather than through some dynamic process."
        },
        {
            "term": "static route",
            "chapters": [
                17
            ],
            "definition": "An IP route on a router created by the user configuring the details of the route on the local router."
        },
        {
            "term": "straight-through cable",
            "chapters": [
                2
            ],
            "definition": "In Ethernet, a cable that connects the wire on pin 1 on one end of the cable to pin 1 on the other end of the cable, pin 2 on one end to pin 2 on the other end, and so on."
        },
        {
            "term": "subinterface",
            "chapters": [
                18
            ],
            "definition": "One of the virtual interfaces on a single physical interface."
        },
        {
            "term": "subnet",
            "chapters": [
                11
            ],
            "definition": "Subdivisions of a Class A, B, or C network, as configured by a network administrator. Subnets allow a single Class A, B, or C network to be used instead of multiple networks, and still allow for a large number of groups of IP addresses, as is required for efficient IP routing."
        },
        {
            "term": "subnet address",
            "chapters": [
                14
            ],
            "definition": "In IPv4, a dotted-decimal number that represents all addresses in a single subnet. Numerically, the smallest value in the range of numbers in a subnet, reserved so that it cannot be used as a unicast IP address by a host."
        },
        {
            "term": "subnet broadcast address",
            "chapters": [
                14
            ],
            "definition": "A special address in each IPv4 subnet, specifically the largest numeric address in the subnet, designed so that packets sent to this address should be delivered to all hosts in that subnet."
        },
        {
            "term": "subnet ID (prefix ID)",
            "chapters": [
                14
            ],
            "definition": "In IPv4, a dotted-decimal number that represents all addresses in a single subnet. Numerically, the smallest value in the range of numbers in a subnet, reserved  so that it cannot be used as a unicast IP address by a host."
        },
        {
            "term": "subnet ID (prefix ID)",
            "chapters": [
                26
            ],
            "definition": "In IPv4, a dotted-decimal number that represents all addresses in a single subnet. Numerically, the smallest value in the range of numbers in a subnet, reserved  so that it cannot be used as a unicast IP address by a host."
        },
        {
            "term": "subnet mask",
            "chapters": [
                11
            ],
            "definition": "A 32-bit number that numerically describes the format of an IP address, by representing the combined network and subnet bits in the address with mask bit values of 1, and representing the host bits in the address with mask bit values of 0."
        },
        {
            "term": "subnet number",
            "chapters": [
                14
            ],
            "definition": "In IPv4, a dotted-decimal number that represents all addresses in a single subnet. Numerically, the smallest value in the range of numbers in a subnet, reserved so that it cannot be used as a unicast IP address by a host."
        },
        {
            "term": "subnet part",
            "chapters": [
                11
            ],
            "definition": "In a subnetted IPv4 address, interpreted with classful addressing rules, one of three parts of the structure of an IP address, with the subnet part uniquely identifying different subnets of a classful IP network."
        },
        {
            "term": "subnet prefix",
            "chapters": [
                25
            ],
            "definition": "The term for a number that represents an IPv6 subnet."
        },
        {
            "term": "subnet prefix",
            "chapters": [
                26
            ],
            "definition": "The term for a number that represents an IPv6 subnet."
        },
        {
            "term": "subnet router anycast address",
            "chapters": [
                26
            ],
            "definition": "A special anycast address in each IPv6 subnet, reserved for use by routers as a way to send a packet to any router on the subnet. The address’s value in each subnet is the same number as the subnet ID."
        },
        {
            "term": "subnet router anycast address",
            "chapters": [
                27
            ],
            "definition": "A special anycast address in each IPv6 subnet, reserved for use by routers as a way to send a packet to any router on the subnet. The address’s value in each subnet is the same number as the subnet ID."
        },
        {
            "term": "subnet zero",
            "chapters": [
                15
            ],
            "definition": "An alternative term for zero subnet."
        },
        {
            "term": "subnetting",
            "chapters": [
                3
            ],
            "definition": "The process of subdividing a Class A, B, or C network into smaller groups called subnets."
        },
        {
            "term": "superior BPDU",
            "chapters": [
                9
            ],
            "definition": "An STP bridge protocol data unit (BPDU) that lists a better (lower) root bridge ID (BID) as compared to the current bridge. A switch that receives a superior BPDU under normal conditions would begin using the new switch with the lower BID as the root switch."
        },
        {
            "term": "switched port",
            "chapters": [
                18
            ],
            "definition": "A reference to the default logic on a Layer 2 switch port, such as learning the source MAC address of received frames and passing incoming frames to the Layer 2 forwarding logic of the device."
        },
        {
            "term": "switched virtual interface (SVI)",
            "chapters": [
                18
            ],
            "definition": "Another term for any VLAN interface in a Cisco switch. "
        },
        {
            "term": "system ID extension",
            "chapters": [
                10
            ],
            "definition": "The term for the formatting applied to the original 16-bit STP priority field to break it into a 4-bit priority field and a 12-bit VLAN ID field."
        },
        {
            "term": "telco",
            "chapters": [
                3
            ],
            "definition": "A common abbreviation for telephone company."
        },
        {
            "term": "Telnet",
            "chapters": [
                4
            ],
            "definition": "The standard terminal-emulation application layer protocol in the TCP/IP protocol stack. Telnet is used for remote terminal connection, enabling users to log in to remote systems and use resources as if they were connected to a local system. Telnet is defined in RFC 854."
        },
        {
            "term": "Telnet",
            "chapters": [
                6
            ],
            "definition": "The standard terminal-emulation application layer protocol in the TCP/IP protocol stack. Telnet is used for remote terminal connection, enabling users to log in to remote systems and use resources as if they were connected to a local system. Telnet is defined in RFC 854."
        },
        {
            "term": "temporary IPv6 address",
            "chapters": [
                28
            ],
            "definition": "When using IPv6 SLAAC, a host creates an address with a relatively short preferred and valid lifetime, usually days long for each, making the address temporary. The host uses the temporary address for outgoing application connections."
        },
        {
            "term": "traceroute",
            "chapters": [
                20
            ],
            "definition": "A program available on many systems that traces the path that a packet takes to a destination. It is used mostly to debug routing problems between hosts."
        },
        {
            "term": "transceiver",
            "chapters": [
                2
            ],
            "definition": "A term formed from the words transmitter and receiver. The hardware used to both send (transmit) energy over some communications medium (e.g., wires in a cable), as well as to process received energy signals to interpret as a series of 1s and 0s."
        },
        {
            "term": "trunk",
            "chapters": [
                8
            ],
            "definition": "In campus LANs, an Ethernet segment over which the devices add a VLAN header that identifies the VLAN in which the frame exists."
        },
        {
            "term": "trunk interface",
            "chapters": [
                8
            ],
            "definition": "A switch interface configured so that it operates using VLAN trunking (either 802.1Q or ISL)."
        },
        {
            "term": "trunking administrative mode",
            "chapters": [
                8
            ],
            "definition": "The configured trunking setting on a Cisco switch interface, as configured with the switchport mode command."
        },
        {
            "term": "trunking operational mode",
            "chapters": [
                8
            ],
            "definition": "The current behavior of a Cisco switch interface for VLAN trunking."
        },
        {
            "term": "ULA global ID",
            "chapters": [
                26
            ],
            "definition": "The unique local address (ULA) for one organization uses a /48 prefix, composed of a set hex FD in the first 8 bits, with a 10-hex digit (40 bit) global ID, which should be generated by a pseudo-random algorithm."
        },
        {
            "term": "unicast address",
            "chapters": [
                2
            ],
            "definition": "Generally, any address in networking that represents a single device or interface, instead of a group of addresses (as would be represented by a multicast or broadcast address)."
        },
        {
            "term": "unicast IP address",
            "chapters": [
                12
            ],
            "definition": "An IP address that represents a single interface. In IPv4, these addresses come from the Class A, B, and C ranges."
        },
        {
            "term": "unidirectional link",
            "chapters": [
                9
            ],
            "definition": "A condition on fiber optic links in which one of the two required fibers fails in a way that also results in both attached switches leaving their interfaces in a working (connected) state—when, in reality, the link can pass frames only in a single direction."
        },
        {
            "term": "unique local address",
            "chapters": [
                26
            ],
            "definition": "A type of IPv6 unicast address meant as a replacement for IPv4 private addresses."
        },
        {
            "term": "unknown unicast frame",
            "chapters": [
                5
            ],
            "definition": "An Ethernet frame whose destination MAC address is not listed in a switch’s MAC address table, so the switch must flood the frame."
        },
        {
            "term": "user mode",
            "chapters": [
                4
            ],
            "definition": "A mode of the user interface to a router or switch in which the user can type only nondisruptive EXEC commands, generally just to look at the current status, but not to change any operational settings."
        },
        {
            "term": "valid lifetime",
            "chapters": [
                28
            ],
            "definition": "In the context of IPv6 addresses, a timer applied to a SLAAC-created address defining how long the address is valid, meaning the host can continue to support existing application flows using the address."
        },
        {
            "term": "variable-length subnet mask (VLSM)",
            "chapters": [
                11
            ],
            "definition": "The capability to specify a different subnet mask for the same Class A, B, or C network number on different subnets. VLSM can help optimize available address space."
        },
        {
            "term": "VLAN",
            "chapters": [
                8
            ],
            "definition": "Virtual LAN. A group of devices, connected to one or more switches, with the devices grouped into a single broadcast domain through switch configuration. VLANs allow switch administrators to separate the devices connected to the switches into separate VLANs without requiring separate physical switches, gaining design advantages of separating the traffic without the expense of buying additional hardware."
        },
        {
            "term": "VLAN interface",
            "chapters": [
                6
            ],
            "definition": "A configuration concept inside Cisco switches, used as an interface between IOS running on the switch and a VLAN supported inside the switch, so that the switch can assign an IP address and send IP packets into that VLAN."
        },
        {
            "term": "VLAN interface",
            "chapters": [
                18
            ],
            "definition": "A configuration concept inside Cisco switches, used as an interface between IOS running on the switch and a VLAN supported inside the switch, so that the switch can assign an IP address and send IP packets into that VLAN."
        },
        {
            "term": "VTP",
            "chapters": [
                8
            ],
            "definition": "VLAN Trunking Protocol. A Cisco-proprietary messaging protocol used between Cisco switches to communicate configuration information about the existence of VLANs, including the VLAN ID and VLAN name."
        },
        {
            "term": "voice VLAN",
            "chapters": [
                8
            ],
            "definition": "A VLAN defined for use by IP Phones, with the Cisco switch notifying the phone about the voice VLAN ID so that the phone can use 802.1Q frames to support traffic for the phone and the attached PC (which uses a data VLAN)."
        },
        {
            "term": "VTP transparent mode",
            "chapters": [
                8
            ],
            "definition": "One of three VTP operational modes. Switches in transparent mode can configure VLANs, but they do not tell other switches about the changes, and they do not learn about VLAN changes from other switches."
        },
        {
            "term": "wide-area network (WAN)",
            "chapters": [
                3
            ],
            "definition": "A part of a larger network that implements mostly OSI Layer 1 and 2 technology, connects sites that typically sit far apart, and uses a business model in which a consumer (individual or business) must lease the WAN from a service provider (often a telco)."
        },
        {
            "term": "wired LAN",
            "chapters": [
                2
            ],
            "definition": "A local-area network (LAN) that physically transmits bits using cables, often the wires inside cables. A term for local-area networks that use cables, emphasizing the fact that the LAN transmits data using wires (in cables) instead of wireless radio waves. "
        },
        {
            "term": "wireless LAN",
            "chapters": [
                2
            ],
            "definition": "A local-area network (LAN) that physically transmits bits using radio waves. The name “wireless” compares these LANs to more traditional “wired” LANs, which are LANs that use cables (which often have copper wires inside)."
        },
        {
            "term": "zero subnet",
            "chapters": [
                15
            ],
            "definition": "For every classful IPv4 network that is subnetted, the one subnet whose subnet number has all binary 0s in the subnet part of the number. In decimal, the zero subnet can be easily identified because it is the same number as the classful network number."
        }
    ]
}